app/controllers/todos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
	def new
		@user = User.find(session[:userid])