app/controllers/users_controller.rb

	def create
		@user = User.create(user_params)
		if(@user.save)
---
INSERT INTO "users" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 07 Sep 2013 10:18:03 UTC +00:00], ["email", "shrikanth_kr@yahoo.com"], ["updated_at", Sat, 07 Sep 2013 10:18:03 UTC +00:00]]
UPDATE "users" SET "password_salt" = ?, "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["password_salt", "$2a$10$nWzyh.EQ5l9XtYA48J6LKu"], ["password_hash", "$2a$10$nWzyh.EQ5l9XtYA48J6LKuPFcTBvlSr9j7U5iKrCQKpEsRjcRE97e"], ["updated_at", Tue, 10 Sep 2013 16:28:19 UTC +00:00]]

	def profile
			@user = User.find(session[:userid])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 5]]